In [1]:
import pandas as pd
import numpy as np

data = pd.Series(np.random.uniform(size=9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.744681
   2    0.195548
   3    0.699814
b  1    0.581790
   3    0.156309
c  1    0.999458
   2    0.491870
d  2    0.721792
   3    0.228467
dtype: float64

In [2]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [3]:
data['b']

1    0.581790
3    0.156309
dtype: float64

In [4]:
data['b':'c']

b  1    0.581790
   3    0.156309
c  1    0.999458
   2    0.491870
dtype: float64

In [5]:
data.loc[['b', 'd']]

b  1    0.581790
   3    0.156309
d  2    0.721792
   3    0.228467
dtype: float64

In [6]:
data.loc[:, 2]

a    0.195548
c    0.491870
d    0.721792
dtype: float64

In [7]:
data.unstack()

          1         2         3
a  0.744681  0.195548  0.699814
b  0.581790       NaN  0.156309
c  0.999458  0.491870       NaN
d       NaN  0.721792  0.228467

In [8]:
data.unstack().stack()

a  1    0.744681
   2    0.195548
   3    0.699814
b  1    0.581790
   3    0.156309
c  1    0.999458
   2    0.491870
d  2    0.721792
   3    0.228467
dtype: float64

In [9]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                        index=[['a', 'a', 'b', 'b'],
                                [1, 2, 1, 2]],
                        columns=[['Ohio', 'Ohio', 'Colorado'],
                                ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [10]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [11]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [12]:
frame.index.nlevels

2

In [13]:
frame.columns.nlevels

2

In [14]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [15]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                            ['Green', 'Red', 'Green']],
                            names=['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [16]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [17]:
frame.sort_index()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [19]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [20]:
frame.sort_index(level=1, axis=1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [21]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [22]:
frame.groupby(level='key2').sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [23]:
frame.T.groupby(level='color').sum().T

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [24]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                     'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [25]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [26]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [27]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [28]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': pd.Series(range(7), dtype='Int64')})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': pd.Series(range(3), dtype='Int64')})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [29]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [30]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [31]:
pd.merge(df2, df1)

  key  data2  data1
0   a      0      2
1   a      0      4
2   a      0      5
3   b      1      0
4   b      1      1
5   b      1      6

In [32]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [33]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': pd.Series(range(7), dtype='Int64')})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': pd.Series(range(3), dtype='Int64')})
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [34]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   c      3   <NA>
7   d   <NA>      2

In [35]:
pd.merge(df1, df2, how='left')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   c      3   <NA>
4   a      4      0
5   a      5      0
6   b      6      1

In [36]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    a      2    a      0
1    a      4    a      0
2    a      5    a      0
3    b      0    b      1
4    b      1    b      1
5    b      6    b      1
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [37]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [38]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': pd.Series(range(6), dtype='Int64')})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': pd.Series(range(5), dtype='Int64')})
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [39]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [40]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [41]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': pd.Series([1, 2, 3], dtype='Int64')})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': pd.Series([4, 5, 6, 7], dtype='Int64')})
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  bar  one     3     6
1  bar  two  <NA>     7
2  foo  one     1     4
3  foo  one     1     5
4  foo  two     2  <NA>

In [42]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [43]:
pd.merge(left, right, on='key1', suffixes=['_left', '_right'])

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [44]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': pd.Series(range(6), dtype='Int64')})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

In [45]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [46]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Colorado', 'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': pd.Series(range(5), dtype='Int64')})
righth_index = pd.MultiIndex.from_arrays([['Nevada', 'Nevada', 'Colorado', 'Ohio', 'Ohio', 'Ohio'],
                                    [2001, 2002, 2002, 2000, 2001, 2002]])
righth = pd.DataFrame({'event1': pd.Series([0, 2, 4, 6, 8, 10], dtype='Int64', index=righth_index),
                       'event2': pd.Series([1, 3, 5, 7, 9, 11], dtype='Int64', index=righth_index)})
lefth

       key1  key2  data
0      Ohio  2000     0
1      Ohio  2001     1
2  Colorado  2002     2
3    Nevada  2001     3
4    Nevada  2002     4

In [47]:
righth

               event1  event2
Nevada   2001       0       1
         2002       2       3
Colorado 2002       4       5
Ohio     2000       6       7
         2001       8       9
         2002      10      11

In [48]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

       key1  key2  data  event1  event2
0      Ohio  2000     0       6       7
1      Ohio  2001     1       8       9
2  Colorado  2002     2       4       5
3    Nevada  2001     3       0       1
4    Nevada  2002     4       2       3

In [49]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

       key1  key2  data  event1  event2
2  Colorado  2002     2       4       5
3    Nevada  2001     3       0       1
4    Nevada  2002     4       2       3
0      Ohio  2000     0       6       7
1      Ohio  2001     1       8       9
4      Ohio  2002  <NA>      10      11

In [50]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Colorado'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13., 14.]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Alabma', 'Texas'])
left2

   Ohio  Colorado
a   1.0       2.0
c   3.0       4.0
e   5.0       6.0

In [51]:
right2

   Alabma  Texas
b     7.0    8.0
c     9.0   10.0
d    11.0   12.0
e    13.0   14.0

In [52]:
pd.merge(left2, right2, left_index=True, right_index=True, how='outer')

   Ohio  Colorado  Alabma  Texas
a   1.0       2.0     NaN    NaN
b   NaN       NaN     7.0    8.0
c   3.0       4.0     9.0   10.0
d   NaN       NaN    11.0   12.0
e   5.0       6.0    13.0   14.0

In [53]:
left2.join(right2, how='outer')

   Ohio  Colorado  Alabma  Texas
a   1.0       2.0     NaN    NaN
b   NaN       NaN     7.0    8.0
c   3.0       4.0     9.0   10.0
d   NaN       NaN    11.0   12.0
e   5.0       6.0    13.0   14.0

In [54]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [55]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'], columns=['NewYork', 'Oregon'])
another

   NewYork  Oregon
a      7.0     8.0
c      9.0    10.0
e     11.0    12.0
f     16.0    17.0

In [56]:
left2.join([right2, another])

   Ohio  Colorado  Alabma  Texas  NewYork  Oregon
a   1.0       2.0     NaN    NaN      7.0     8.0
c   3.0       4.0     9.0   10.0      9.0    10.0
e   5.0       6.0    13.0   14.0     11.0    12.0

In [57]:
left2.join([right2, another], how='outer')

   Ohio  Colorado  Alabma  Texas  NewYork  Oregon
a   1.0       2.0     NaN    NaN      7.0     8.0
c   3.0       4.0     9.0   10.0      9.0    10.0
e   5.0       6.0    13.0   14.0     11.0    12.0
b   NaN       NaN     7.0    8.0      NaN     NaN
d   NaN       NaN    11.0   12.0      NaN     NaN
f   NaN       NaN     NaN    NaN     16.0    17.0

In [58]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [59]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [60]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [61]:
s1 = pd.Series([0, 1], index=['a', 'b'], dtype='Int64')
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'], dtype='Int64')
s3 = pd.Series([5, 6], index=['f', 'g'], dtype='Int64')
s1

a    0
b    1
dtype: Int64

In [62]:
s2

c    2
d    3
e    4
dtype: Int64

In [63]:
s3

f    5
g    6
dtype: Int64

In [64]:
np.concatenate([s1, s2, s3])

array([0, 1, 2, 3, 4, 5, 6])

In [65]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [66]:
pd.concat([s1, s2, s3], axis=1)

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [67]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: Int64

In [68]:
pd.concat([s1, s4], axis=1)

      0  1
a     0  0
b     1  1
f  <NA>  5
g  <NA>  6

In [69]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [70]:
result = pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: Int64

In [71]:
result.unstack()

          a     b     c     d     e     f     g
one       0     1  <NA>  <NA>  <NA>  <NA>  <NA>
two    <NA>  <NA>     2     3     4  <NA>  <NA>
three  <NA>  <NA>  <NA>  <NA>  <NA>     5     6

In [72]:
result.unstack().stack()

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: Int64

In [73]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

    one   two  three
a     0  <NA>   <NA>
b     1  <NA>   <NA>
c  <NA>     2   <NA>
d  <NA>     3   <NA>
e  <NA>     4   <NA>
f  <NA>  <NA>      5
g  <NA>  <NA>      6

In [74]:
df1 = pd.DataFrame(np.arange(6).reshape((3, 2)), index=['a', 'b', 'c'],
                    columns=['one', 'two'])
df2 = pd.DataFrame(np.arange(4).reshape((2, 2)), index=['a', 'c'],
                    columns=['three', 'four'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [75]:
df2

   three  four
a      0     1
c      2     3

In [76]:
pd.concat([df1, df2])

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    0.0   1.0
c  NaN  NaN    2.0   3.0

In [77]:
pd.concat([df1, df2], axis=1)

   one  two  three  four
a    0    1    0.0   1.0
b    2    3    NaN   NaN
c    4    5    2.0   3.0

In [78]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    NaN  NaN
c      4   5    2.0  3.0

In [79]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    NaN  NaN
c      4   5    2.0  3.0

In [80]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
           names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    0.0  1.0
b          2   3    NaN  NaN
c          4   5    2.0  3.0

In [81]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'c', 'd'])
df1

          a         b         c         d
0  0.433356 -0.298009  0.704324 -0.882904
1  0.695735  1.120415 -0.883268 -1.490347
2  0.214169  0.253800  1.643179  0.588468

In [82]:
df2

          b         c         d
0 -1.118954  1.095143  2.043813
1 -0.526120  0.601688 -1.062633

In [83]:
pd.concat([df1, df2], axis=1)

          a         b         c         d         b         c         d
0  0.433356 -0.298009  0.704324 -0.882904 -1.118954  1.095143  2.043813
1  0.695735  1.120415 -0.883268 -1.490347 -0.526120  0.601688 -1.062633
2  0.214169  0.253800  1.643179  0.588468       NaN       NaN       NaN

In [84]:
pd.concat([df1, df2])

          a         b         c         d
0  0.433356 -0.298009  0.704324 -0.882904
1  0.695735  1.120415 -0.883268 -1.490347
2  0.214169  0.253800  1.643179  0.588468
0       NaN -1.118954  1.095143  2.043813
1       NaN -0.526120  0.601688 -1.062633

In [85]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  0.433356 -0.298009  0.704324 -0.882904
1  0.695735  1.120415 -0.883268 -1.490347
2  0.214169  0.253800  1.643179  0.588468
3       NaN -1.118954  1.095143  2.043813
4       NaN -0.526120  0.601688 -1.062633

In [86]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.],
              index=['a', 'b', 'c', 'd', 'e', 'f'])
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [87]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [88]:
np.where(pd.isna(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, 5. ])

In [89]:
a.combine_first(b)

a    0.0
b    4.5
c    3.5
d    NaN
e    2.5
f    5.0
dtype: float64

In [90]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    NaN
e    2.5
f    5.0
dtype: float64

In [91]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                   'b': [np.nan, 2., np.nan, 6.],
                   'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [92]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [93]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [94]:
df2.combine_first(df1)

     a    b     c
0  5.0  NaN   2.0
1  4.0  3.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [95]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [97]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [98]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [99]:
result.unstack(level=0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [100]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'], dtype='Int64')
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'], dtype='Int64')
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [101]:
data2.unstack()

        a     b  c  d     e
one     0     1  2  3  <NA>
two  <NA>  <NA>  4  5     6

In [103]:
data2.unstack().stack(future_stack=True)

one  a       0
     b       1
     c       2
     d       3
     e    <NA>
two  a    <NA>
     b    <NA>
     c       4
     d       5
     e       6
dtype: Int64

In [105]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                    columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [107]:
df.unstack(level='state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [109]:
df.unstack(level='state').stack(level='side', future_stack=True)

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

In [115]:
data = pd.read_csv('examples/macrodata.csv')
data = data.loc[:, ['year', 'quarter', 'realgdp', 'infl', 'unemp']]
data.head()

   year  quarter   realgdp  infl  unemp
0  1959        1  2710.349  0.00    5.8
1  1959        2  2778.801  2.34    5.1
2  1959        3  2775.488  2.74    5.3
3  1959        4  2785.204  0.27    5.6
4  1960        1  2847.699  2.31    5.2

In [119]:
periods = pd.PeriodIndex.from_fields(year=data.year, quarter=data.quarter)
periods.name = 'date'
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203)

In [120]:
data.index = periods.to_timestamp('D')

In [121]:
data.head()

            year  quarter   realgdp  infl  unemp
date
1959-01-01  1959        1  2710.349  0.00    5.8
1959-04-01  1959        2  2778.801  2.34    5.1
1959-07-01  1959        3  2775.488  2.74    5.3
1959-10-01  1959        4  2785.204  0.27    5.6
1960-01-01  1960        1  2847.699  2.31    5.2

In [122]:
data = data.reindex(columns=['realgdp', 'infl', 'unemp'])
data.columns.name = 'item'
data.head()

item         realgdp  infl  unemp
date
1959-01-01  2710.349  0.00    5.8
1959-04-01  2778.801  2.34    5.1
1959-07-01  2775.488  2.74    5.3
1959-10-01  2785.204  0.27    5.6
1960-01-01  2847.699  2.31    5.2

In [125]:
long_data = data.stack().reset_index().rename(columns={0: 'value'})
long_data.head()

        date     item     value
0 1959-01-01  realgdp  2710.349
1 1959-01-01     infl     0.000
2 1959-01-01    unemp     5.800
3 1959-04-01  realgdp  2778.801
4 1959-04-01     infl     2.340

In [126]:
long_data[:10]

        date     item     value
0 1959-01-01  realgdp  2710.349
1 1959-01-01     infl     0.000
2 1959-01-01    unemp     5.800
3 1959-04-01  realgdp  2778.801
4 1959-04-01     infl     2.340
5 1959-04-01    unemp     5.100
6 1959-07-01  realgdp  2775.488
7 1959-07-01     infl     2.740
8 1959-07-01    unemp     5.300
9 1959-10-01  realgdp  2785.204

In [127]:
pivoted = long_data.pivot(index='date', columns='item', values='value')
pivoted.head()

item        infl   realgdp  unemp
date
1959-01-01  0.00  2710.349    5.8
1959-04-01  2.34  2778.801    5.1
1959-07-01  2.74  2775.488    5.3
1959-10-01  0.27  2785.204    5.6
1960-01-01  2.31  2847.699    5.2

In [128]:
long_data['value2'] = np.random.standard_normal(len(long_data))
long_data.head()

        date     item     value    value2
0 1959-01-01  realgdp  2710.349 -1.543976
1 1959-01-01     infl     0.000  1.395645
2 1959-01-01    unemp     5.800  1.281327
3 1959-04-01  realgdp  2778.801  0.198825
4 1959-04-01     infl     2.340 -0.450956

In [129]:
pivoted = long_data.pivot(index='date', columns='item')

In [130]:
pivoted[:10]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-01-01  0.00  2710.349   5.8  1.395645 -1.543976  1.281327
1959-04-01  2.34  2778.801   5.1 -0.450956  0.198825  1.217343
1959-07-01  2.74  2775.488   5.3  0.723212  0.242603  0.994802
1959-10-01  0.27  2785.204   5.6 -0.675950  0.519732 -2.272614
1960-01-01  2.31  2847.699   5.2 -1.354460 -0.663241 -0.231159
1960-04-01  0.14  2834.390   5.2 -0.195869  1.011914 -0.765540
1960-07-01  2.70  2839.022   5.6  1.198896  0.181996  0.258386
1960-10-01  1.21  2802.616   6.3  1.469975 -0.792518  1.791940
1961-01-01 -0.40  2819.264   6.8  0.029554 -1.117199  0.355628
1961-04-01  1.47  2872.005   7.0  2.340124 -0.161758 -1.382452

In [131]:
pivoted['value'][:10]

item        infl   realgdp  unemp
date
1959-01-01  0.00  2710.349    5.8
1959-04-01  2.34  2778.801    5.1
1959-07-01  2.74  2775.488    5.3
1959-10-01  0.27  2785.204    5.6
1960-01-01  2.31  2847.699    5.2
1960-04-01  0.14  2834.390    5.2
1960-07-01  2.70  2839.022    5.6
1960-10-01  1.21  2802.616    6.3
1961-01-01 -0.40  2819.264    6.8
1961-04-01  1.47  2872.005    7.0

In [133]:
unstacked = long_data.set_index(['date', 'item']).unstack(level='item')
unstacked[:10]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-01-01  0.00  2710.349   5.8  1.395645 -1.543976  1.281327
1959-04-01  2.34  2778.801   5.1 -0.450956  0.198825  1.217343
1959-07-01  2.74  2775.488   5.3  0.723212  0.242603  0.994802
1959-10-01  0.27  2785.204   5.6 -0.675950  0.519732 -2.272614
1960-01-01  2.31  2847.699   5.2 -1.354460 -0.663241 -0.231159
1960-04-01  0.14  2834.390   5.2 -0.195869  1.011914 -0.765540
1960-07-01  2.70  2839.022   5.6  1.198896  0.181996  0.258386
1960-10-01  1.21  2802.616   6.3  1.469975 -0.792518  1.791940
1961-01-01 -0.40  2819.264   6.8  0.029554 -1.117199  0.355628
1961-04-01  1.47  2872.005   7.0  2.340124 -0.161758 -1.382452

In [134]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [135]:
melted = pd.melt(df, id_vars=['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [136]:
reshaped = melted.pivot(index='key', columns='variable', values='value')

In [137]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [138]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [139]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [140]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [141]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6